Tekla.Structures.Dialog.UIControls.WpfBoltCatalogStandard
The WpfBoltCatalogStandard class represents a control to select the bolt standard
using the bolt catalog.
Bolt catalog controls always need to be in pairs, meaning in every dialog
there has to be a WpfBoltCatalogStandard and a WpfBoltCatalogSize control.

Tekla.Structures.Dialog.UIControls.WpfBoltCatalogStandard.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfBoltCatalogStandard.BoltSizes
Returns bolt sizes in catalog based on selected grade

Tekla.Structures.Dialog.UIControls.WpfBoltCatalogStandard.OnVisualParentChanged(System.Windows.DependencyObject)
When the parent is visible, updates the values in the
BoltCatalogSize combo box.
oldParent: The event arguments.